# Problem 1

NIM        : 16520251

Nama       : Rofif Fairuz Hawary

Sesi/Kelas : 3.1/D

Tanggal    : 13 Desember 2020

Deskripsi : Dasar pengaksesan dataset

In [13]:
import pandas as pd

Menggunakan file dataset nilai_uas.csv sebagai variabel df

In [14]:
df = pd.read_csv("nilai_uas.csv")

# 1

Mencari banyaknya data dalam df

In [15]:
len(df)

3562

# 2

Mengambil 10 data pertama dalam df

In [16]:
df[:10]

                  nama fakultas  nilai_kal  nilai_fis  nilai_kim
0         Raihan Daris       SF      60.27      65.59      51.70
1           Galuh Wina     STEI      52.99      55.25      66.31
2         Johannes Sun    FMIPA      51.20      51.30      84.70
3  Abdurrahman WIlliam     FTSL      31.17      36.88      50.25
4         Rayhan Faris     STEI      55.55      57.61      67.46
5  Margareth Widyatama     FTTM      42.78      50.23      71.17
6      Christofer Jaza     FTSL      31.64      38.03      34.99
7         Wafika Nadia       SF      60.96      57.54      76.03
8  Elizabeth Parikesit     STEI      54.35      55.30      59.15
9         Halida Aqila    SITHR      63.71      67.23      63.76

# 3

Mengoutputkan data ke 50-60 secara line, dan secara tabel

In [20]:
#loop untuk mentraversalkan data secara line
for i in range(49,60):
    print("Data ke-" + str(i+1))
    print(df.loc[i])
    print()
df[49:60] # mengambil data 50-60 secara tabel

Data ke-50
nama         Kenesha Monica
fakultas               FTTM
nilai_kal             41.63
nilai_fis             39.58
nilai_kim             61.25
Name: 49, dtype: object

Data ke-51
nama         Ulul Mochammad
fakultas               FTTM
nilai_kal             38.75
nilai_fis             44.24
nilai_kim             40.11
Name: 50, dtype: object

Data ke-52
nama         George Vrince
fakultas              FITB
nilai_kal            44.02
nilai_fis            45.15
nilai_kim            41.76
Name: 51, dtype: object

Data ke-53
nama         Fayza Eunike
fakultas             STEI
nilai_kal           55.28
nilai_fis           59.47
nilai_kim           49.29
Name: 52, dtype: object

Data ke-54
nama         Kevin Faustin
fakultas             SAPPK
nilai_kal            47.72
nilai_fis            49.65
nilai_kim            52.76
Name: 53, dtype: object

Data ke-55
nama         salah Siagian
fakultas             SAPPK
nilai_kal            47.14
nilai_fis            51.26
nilai_kim            46.77
Name: 54, dtype: object

Data ke-56
nama         Nabilah Satya
fakultas                SF
nilai_kal            61.26
nilai_fis            63.96
nilai_kim            57.19
Name: 55, dtype: object

Data ke-57
nama         Tharisa Ghiffari
fakultas                 FSRD
nilai_kal               74.14
nilai_fis               78.86
nilai_kim               54.59
Name: 56, dtype: object

Data ke-58
nama         Setyawan Ahmad
fakultas               FSRD
nilai_kal             75.18
nilai_fis             78.33
nilai_kim             51.35
Name: 57, dtype: object

Data ke-59
nama         Kelvin Salsabiela
fakultas                  FTTM
nilai_kal                39.69
nilai_fis                40.92
nilai_kim                51.15
Name: 58, dtype: object

Data ke-60
nama         Sitorus Aidil
fakultas              FTMD
nilai_kal            58.49
nilai_fis            55.54
nilai_kim             55.2
Name: 59, dtype: object

                 nama fakultas  nilai_kal  nilai_fis  nilai_kim
49     Kenesha Monica     FTTM      41.63      39.58      61.25
50     Ulul Mochammad     FTTM      38.75      44.24      40.11
51      George Vrince     FITB      44.02      45.15      41.76
52       Fayza Eunike     STEI      55.28      59.47      49.29
53      Kevin Faustin    SAPPK      47.72      49.65      52.76
54      salah Siagian    SAPPK      47.14      51.26      46.77
55      Nabilah Satya       SF      61.26      63.96      57.19
56   Tharisa Ghiffari     FSRD      74.14      78.86      54.59
57     Setyawan Ahmad     FSRD      75.18      78.33      51.35
58  Kelvin Salsabiela     FTTM      39.69      40.92      51.15
59      Sitorus Aidil     FTMD      58.49      55.54      55.20

# 4

Mengoutputkan banyaknya mahasiswa tiap fakultas

In [22]:
df["fakultas"].value_counts()

STEI     499
FTTM     454
FTSL     424
FMIPA    396
FTMD     352
FITB     283
SBM      261
FSRD     260
SAPPK    198
SITHR    179
SF       154
SITHS    102
Name: fakultas, dtype: int64

# 5

mencari nilai korelasi antara nilai fisika dengan nilai kalkulus

In [19]:
df["nilai_kal"].corr(df["nilai_fis"])

0.9605289823695181

karena nilai koefisien korelasi mendekati 1, maka nilai kalkulus dan nilai fisika berkorelasi lurus. Terbukti dari nilai-nilai yang dimiliki mahasiswa antara matematika dan fisika cenderung tidak berbeda jauh.